nxp-mcuxpresso/mcux-sdk-examples/lpcxpresso54628/usb_examples/usb_host_audio_recorder/freertos/pin_mux.c
    const uint32_t SD_POW_EN = (/* Pin is configured as SD_POW_EN */
                                IOCON_PIO_FUNC2 |
                                /* No addition pin function */
                                IOCON_PIO_MODE_INACT |
                                /* Input function is not inverted */
                                IOCON_PIO_INV_DI |
                                /* Enables digital function */
                                IOCON_PIO_DIGITAL_EN |
                                /* Input filter disabled */
                                IOCON_PIO_INPFILT_OFF |
                                /* Standard mode, output slew rate control is enabled */
                                IOCON_PIO_SLEW_STANDARD |
                                /* Open drain is disabled */
                                IOCON_PIO_OPENDRAIN_DI);
    /* PORT2 PIN5 (coords: C1) is configured as SD_POW_EN */
    IOCON_PinMuxSet(IOCON, BOARD_INITPINS_SD_POW_EN_PORT, BOARD_INITPINS_SD_POW_EN_PIN, SD_POW_EN);

    const uint32_t SD_D0 = (/* Pin is configured as SD_D(0) */
                            IOCON_PIO_FUNC2 |
                            /* No addition pin function */
                            IOCON_PIO_MODE_INACT |
                            /* Input function is not inverted */
                            IOCON_PIO_INV_DI |
                            /* Enables digital function */
                            IOCON_PIO_DIGITAL_EN |
                            /* Input filter disabled */
                            IOCON_PIO_INPFILT_OFF |
                            /* Fast mode, slew rate control is disabled */
                            IOCON_PIO_SLEW_FAST |
                            /* Open drain is disabled */
                            IOCON_PIO_OPENDRAIN_DI);
    /* PORT2 PIN6 (coords: F3) is configured as SD_D(0) */
    IOCON_PinMuxSet(IOCON, BOARD_INITPINS_SD_D0_PORT, BOARD_INITPINS_SD_D0_PIN, SD_D0);

    const uint32_t SD_D1 = (/* Pin is configured as SD_D(1) */
                            IOCON_PIO_FUNC2 |
                            /* No addition pin function */
                            IOCON_PIO_MODE_INACT |
                            /* Input function is not inverted */
                            IOCON_PIO_INV_DI |
                            /* Enables digital function */
                            IOCON_PIO_DIGITAL_EN |
                            /* Input filter disabled */
                            IOCON_PIO_INPFILT_OFF |
                            /* Fast mode, slew rate control is disabled */
                            IOCON_PIO_SLEW_FAST |
                            /* Open drain is disabled */
                            IOCON_PIO_OPENDRAIN_DI);
    /* PORT2 PIN7 (coords: J2) is configured as SD_D(1) */
    IOCON_PinMuxSet(IOCON, BOARD_INITPINS_SD_D1_PORT, BOARD_INITPINS_SD_D1_PIN, SD_D1);

    const uint32_t SD_D2 = (/* Pin is configured as SD_D(2) */
                            IOCON_PIO_FUNC2 |
                            /* No addition pin function */
                            IOCON_PIO_MODE_INACT |
                            /* Input function is not inverted */
                            IOCON_PIO_INV_DI |
                            /* Enables digital function */
                            IOCON_PIO_DIGITAL_EN |
                            /* Input filter disabled */
                            IOCON_PIO_INPFILT_OFF |
                            /* Fast mode, slew rate control is disabled */
                            IOCON_PIO_SLEW_FAST |
                            /* Open drain is disabled */
                            IOCON_PIO_OPENDRAIN_DI);
    /* PORT2 PIN8 (coords: F4) is configured as SD_D(2) */
    IOCON_PinMuxSet(IOCON, BOARD_INITPINS_SD_D2_PORT, BOARD_INITPINS_SD_D2_PIN, SD_D2);

    const uint32_t SD_D3 = (/* Pin is configured as SD_D(3) */
                            IOCON_PIO_FUNC2 |
                            /* No addition pin function */
                            IOCON_PIO_MODE_INACT |
                            /* Input function is not inverted */
                            IOCON_PIO_INV_DI |
                            /* Enables digital function */
                            IOCON_PIO_DIGITAL_EN |
                            /* Input filter disabled */
                            IOCON_PIO_INPFILT_OFF |
                            /* Fast mode, slew rate control is disabled */
                            IOCON_PIO_SLEW_FAST |
                            /* Open drain is disabled */
                            IOCON_PIO_OPENDRAIN_DI);
    /* PORT2 PIN9 (coords: K2) is configured as SD_D(3) */
    IOCON_PinMuxSet(IOCON, BOARD_INITPINS_SD_D3_PORT, BOARD_INITPINS_SD_D3_PIN, SD_D3);

    const uint32_t SD_WPn = (/* Pin is configured as SD_WR_PRT */
                             IOCON_PIO_FUNC2 |
                             /* No addition pin function */
                             IOCON_PIO_MODE_INACT |
                             /* Input function is not inverted */
                             IOCON_PIO_INV_DI |
                             /* Enables digital function */
                             IOCON_PIO_DIGITAL_EN |
                             /* Input filter disabled */
                             IOCON_PIO_INPFILT_OFF |
                             /* Standard mode, output slew rate control is enabled */
                             IOCON_PIO_SLEW_STANDARD |
                             /* Open drain is disabled */
                             IOCON_PIO_OPENDRAIN_DI);
    /* PORT3 PIN15 (coords: D2) is configured as SD_WR_PRT */
    IOCON_PinMuxSet(IOCON, BOARD_INITPINS_SD_WPn_PORT, BOARD_INITPINS_SD_WPn_PIN, SD_WPn);

    const uint32_t port4_pin7_config = (/* Pin is configured as USB0_PORTPWRN */
                                        IOCON_PIO_FUNC3 |
                                        /* No addition pin function */
                                        IOCON_PIO_MODE_INACT |
                                        /* Input function is not inverted */
                                        IOCON_PIO_INV_DI |
                                        /* Enables digital function */
                                        IOCON_PIO_DIGITAL_EN |
                                        /* Input filter disabled */
                                        IOCON_PIO_INPFILT_OFF |
                                        /* Standard mode, output slew rate control is enabled */
                                        IOCON_PIO_SLEW_STANDARD |
                                        /* Open drain is disabled */
                                        IOCON_PIO_OPENDRAIN_DI);
    /* PORT4 PIN7 (coords: A14) is configured as USB0_PORTPWRN */
    IOCON_PinMuxSet(IOCON, 4U, 7U, port4_pin7_config);

    const uint32_t ENET_TXD0 = (/* Pin is configured as USB0_OVERCURRENTN */
                                IOCON_PIO_FUNC3 |
                                /* No addition pin function */
                                IOCON_PIO_MODE_INACT |
                                /* Input function is not inverted */
                                IOCON_PIO_INV_DI |
                                /* Enables digital function */
                                IOCON_PIO_DIGITAL_EN |
                                /* Input filter disabled */
                                IOCON_PIO_INPFILT_OFF |
                                /* Standard mode, output slew rate control is enabled */
                                IOCON_PIO_SLEW_STANDARD |
                                /* Open drain is disabled */
                                IOCON_PIO_OPENDRAIN_DI);
    /* PORT4 PIN8 (coords: B14) is configured as USB0_OVERCURRENTN */
    IOCON_PinMuxSet(IOCON, BOARD_INITPINS_ENET_TXD0_PORT, BOARD_INITPINS_ENET_TXD0_PIN, ENET_TXD0);

    const uint32_t port4_pin9_config = (/* Pin is configured as USB1_PORTPWRN */
                                        IOCON_PIO_FUNC3 |
                                        /* Selects pull-up function */
                                        IOCON_PIO_MODE_PULLUP |
                                        /* Input function is not inverted */
                                        IOCON_PIO_INV_DI |
                                        /* Enables digital function */
                                        IOCON_PIO_DIGITAL_EN |
                                        /* Input filter disabled */
                                        IOCON_PIO_INPFILT_OFF |
                                        /* Standard mode, output slew rate control is enabled */
                                        IOCON_PIO_SLEW_STANDARD |
                                        /* Open drain is disabled */
                                        IOCON_PIO_OPENDRAIN_DI);
    /* PORT4 PIN9 (coords: A12) is configured as USB1_PORTPWRN */
    IOCON_PinMuxSet(IOCON, 4U, 9U, port4_pin9_config);
}
/***********************************************************************************************************************
 * EOF
 **********************************************************************************************************************/
